"""
1. Реализовать скрипт, в котором должна быть предусмотрена функция расчёта заработной платы сотрудника. Используйте в
нём формулу: (выработка в часах*ставка в час) + премия. Во время выполнения расчёта для конкретных значений необходимо
запускать скрипт с параметрами.
"""

from sys import argv

virabotka, stavka, premia = map(int, argv[1:])

print('Заработная плата: {0}'.format(virabotka*stavka + premia))
